{
  "broadArea": {
    "name": "Electrical Engineering",
    "link": "https://www.vlab.co.in/broad-area-electrical-engineering",
    "code": "EE"
  },
  "lab": "Basic Electrical Science",
  "lab_display_name": "Basic Electrical Science",
  "phase": "3-ext",
  "collegeName": "IITR",
  "baseUrl": "bes-iitr.vlabs.ac.in",
  "introduction": "The Basic Electrical Science Virtual Lab is designed to provide students with a fundamental understanding of electrical concepts through interactive virtual experiments. This lab serves as a foundation for students pursuing engineering, physics, and related technical disciplines. It enables learners to explore electrical theories, circuit analysis, and component behavior in a simulated environment, eliminating the need for physical hardware while maintaining the hands-on experience of practical learning.<br>The virtual lab covers key topics such as Ohm’s Law, Kirchhoff’s Laws, AC/DC circuits, electrical measurements, and power calculations. Through simulations, students can design and analyse circuits, measure voltage, current, and resistance, and understand real-world electrical applications. This interactive platform enhances conceptual understanding, improves problem-solving skills, and bridges the gap between theory and practical application.By leveraging the advantages of virtual labs, students can conduct experiments anytime and anywhere, promoting flexible and self-paced learning. The Basic Electrical Science Virtual Lab aims to provide an immersive, engaging, and efficient learning experience, preparing students for more advanced studies in electrical engineering and related fields.",
  "experiments":[
    {
        "name": "Familiarization with the Electrical Equipments",
        "short-name": "electrical-equipments",
        "repo": "https://github.com/virtual-labs/exp-electrical-equipments-iitr",
        "tag": "v1.0.1",
        "deploy": true
    },
    {
        "name": "To Study and Verify the Kirchhoff Law",
        "short-name": "kirchhoff-law",
        "repo": "https://github.com/virtual-labs/exp-kirchhoff-law-iitr",
        "tag": "v1.0.1",
        "deploy": true
    },
    {
        "name": "To Study and Measure the Power Factor of an Electrical Load",
        "short-name": "power-factor",
        "repo": "https://github.com/virtual-labs/exp-fluorescent-lamps-iitr",
        "tag": "v1.0.1",
        "deploy": true
    },
    {
        "name": "To Study and Verify the Network Theorem",
        "short-name": "network-theorem",
        "repo": "https://github.com/virtual-labs/exp-network-theorem-iitr",
        "tag": "v1.0.3",
        "deploy": true
    },
    {
        "name": "To Study and Measure the Power Consumed by Three Phase Resistive Load by Two Wattmeter Method",
        "short-name": "two-wattmeter-method",
        "repo": "https://github.com/virtual-labs/exp-two-wattmeter-method-iitr",
        "tag": "v1.0.2",
        "deploy": true
    },
    {
        "name": "To Study and Measure the Voltage, Current, Power, and Power Factor in Series RLC Circuit",
        "short-name": "series-rlc-circuit",
        "repo": "https://github.com/virtual-labs/exp-series-rlc-circuit-iitr",
        "tag": "v1.0.1",
        "deploy": true
    },
    {
        "name": "To Study and Measure the Voltage, Current, Power, and Power Factor in Parallel RLC Circuit",
        "short-name": "parallel-rlc-circuit",
        "repo": "https://github.com/virtual-labs/exp-parallel-rlc-circuit-iitr",
        "tag": "v1.0.1",
        "deploy": true
    },
    {
        "name": "To Study the Efficiency of Single Phase Transformer by Load Test",
        "short-name": "single-phase-transformer",
        "repo": "https://github.com/virtual-labs/exp-single-phase-transformer-iitr",
        "tag": "v1.0.1",
        "deploy": true
    },
    {
        "name": "To Study the Torque-Speed Characteristics of Three Phase Induction Motor",
        "short-name": "three-phase-induction-motor",
        "repo": "https://github.com/virtual-labs/exp-three-phase-induction-motor-iitr",
        "tag": "v1.0.2",
        "deploy": true
    },
    {
        "name": "To Determine the Resonance Frequency in a Series RLC Circuit",
        "short-name": "resonance-series-rlc",
        "repo": "https://github.com/virtual-labs/exp-resonance-frequency-in-a-series-rlc-circuit-iitr",
        "tag": "v1.0.1",
        "deploy": true
    }
],
  "targetAudience": {
    "UG": [
      "UG (1st Year)"
    ]
  },
  "objective": "Students will be able to learn <ul><li>Various electrical laws and principle associated with electrical system.</li><li>The fundamental of designing and operation of electrical machines</li>",
  "courseAlignment": {
    "description": "The syllabi of this lab aligns to the following universities in India.",
    "universities": [
      "Dr. A.P.J Abdul Kalam Technical University Lucknow; KEE 351; B. Tech 1st year",
      "Jawaharlal Nehru Technological University: Kakinada; EE103ES; B. Tech: Electrical Engineering",
      "Maulana Abul Kalam Azad University Of Technology, West Bengal; EE-402; B. Tech: Electrical Engineering"
    ]

  }
}
